Repository: gerrybagaskoro/absensi_ppkdjp_b3
Catalog: lib/l10n/app_*.arb
Languages: id

# language
source: English
id: Indonesia

# languageSettingsTitle
source: Language
id: Bahasa

source: Settings
id: Pengaturan

source: Profile
id: Profil

source: Edit Profile
id: Sunting Profil

# exportHistory
source: Export Attendance History
id: Ekspor Riwayat Absensi

source: About App
id: Tentang Aplikasi

source: Logout
id: Keluar

source: Cancel
id: Batal

# confirmLogout
source: Are you sure you want to log out?
id: Apakah Anda yakin ingin keluar dari aplikasi?

source: Yes, Logout
id: Ya, Keluar

source: Save
id: Simpan

source: Delete
id: Hapus

# theme
source: App Theme
id: Tema Aplikasi

# themeLight
source: Light
id: Terang

# themeDark
source: Dark
id: Gelap

# themeSystem
source: System Default
id: Mengikuti Sistem

source: Notification
id: Notifikasi

source: Daily Reminder
id: Atur Pengingat Harian

# dailyReminderDesc
source: Reminder to clock in daily
id: Pengingat untuk absen setiap hari

# successSave
source: Settings saved successfully
id: Pengaturan berhasil disimpan

# onboardingTitle1
source: Easy Attendance
id: Absensi Mudah

# onboardingDesc1
source: Clock in and out easily directly from your smartphone.
id: Lakukan absensi masuk dan pulang dengan mudah langsung dari smartphone Anda.

# onboardingTitle2
source: Realtime History
id: Riwayat Realtime

# onboardingDesc2
source: Monitor your attendance history in realtime.
id: Pantau riwayat kehadiran Anda secara realtime.

# onboardingTitle3
source: Detailed Reports
id: Laporan Detail

# onboardingDesc3
source: Get detailed attendance reports anytime.
id: Dapatkan laporan kehadiran terperinci kapan saja.

# onboardingDesc4
source: Ready for digital attendance? Let's get started!
id: Siap untuk presensi digital? Yuk kita mulai!

source: Get Started
id: Mulai Sekarang

source: Skip
id: Lewati

# loginTitle
source: Welcome Back!
id: Selamat Datang!

# loginSubtitle
source: Please login to continue
id: Silakan masuk untuk melanjutkan

# passwordLabel
source: Password
id: Kata sandi

# loginButton
source: Login
id: Masuk

source: Dashboard
id: Beranda

source: History
id: Riwayat

source: Clock In
id: Absen Masuk

source: Clock Out
id: Absen Pulang

# greetingMorning
source: Good Morning
id: Selamat Pagi

# greetingAfternoon
source: Good Afternoon
id: Selamat Siang

# greetingEvening
source: Good Evening
id: Selamat Sore

# greetingNight
source: Good Night
id: Selamat Malam

# loginTitleHeader
source: Login to Attendance
id: Masuk untuk Presensi

# emailEmpty
source: Email cannot be empty
id: E-mail tidak boleh kosong

# emailInvalid
source: Invalid E-mail format
id: Format E-mail tidak valid

# passwordEmpty
source: Password cannot be empty
id: Kata sandi tidak boleh kosong

# passwordMinLength
source: At least 6 characters
id: Minimal 6 karakter

# noAccount
source: Don't have an account?
id: Belum punya akun?

# registerAction
source: Register here
id: Daftar di sini

# forgotPasswordPrompt
source: Forgot password?
id: Lupa kata sandi?

# resetAction
source: Reset here
id: Reset di sini

source: Loading
id: Sedang memuat

# loginSuccess
source: Login successful!
id: Login berhasil!

source: Login failed
id: Login gagal

# loginInvalidData
source: Invalid login data from server
id: Data login tidak valid dari server

# loginError
source: An error occurred: {error}
id: Terjadi kesalahan: {error}

source: Statistic
id: Statistik

# permission
source: Leave Request
id: Izin

# todayStatus
source: Today's Status
id: Status Absen Hari Ini

source: Not Present
id: Belum Absen

source: Check In
id: Masuk

source: Check Out
id: Pulang

# reasonPermission
source: Permission Reason:
id: Alasan Izin:

# permissionToday
source: 📌 You have permission today
id: 📌 Anda sedang izin hari ini

# farLocation
source: ⚠️ You are far from PPKDJP location
id: ⚠️ Anda jauh dari lokasi PPKDJP

# alreadyPresent
source: ✅ You have clocked in & out today
id: ✅ Anda sudah absen masuk & pulang hari ini

source: Location not available
id: Lokasi belum tersedia

# checkInSuccess
source: Check In successful
id: Absen masuk berhasil

source: Check In failed
id: Gagal absen masuk

# checkOutSuccess
source: Check Out successful
id: Absen pulang berhasil

source: Check Out failed
id: Gagal absen pulang

# checkInError
source: Error occurred: {error}
id: Terjadi error saat absen: {error}

# statusNotPresent
source: Not Present
id: Belum Absen

# statusPresent
source: Present
id: Hadir

# statusLate
source: Late
id: Telat

# statusPermission
source: Excused
id: Izin

# statusAbsent
source: Absent
id: Alpha

# exportHistorySubtitle
source: Download attendance history in PDF format
id: Unduh riwayat absensi dalam format PDF

# dailyReminderTime
source: Every day at {time}
id: Setiap hari jam {time}

# confirm
source: Confirmation
id: Konfirmasi

# logoutConfirm
source: Are you sure you want to log out?
id: Apakah Anda yakin ingin keluar dari aplikasi?

# logoutSuccess
source: You have logged out.
id: Anda telah keluar.

source: No name
id: Tidak ada nama

source: No email
id: Tidak ada email

source: Batch
id: Batch ke-

source: Training:
id: Pelatihan:

# historyTitle
source: Attendance History
id: Riwayat Presensi

# holdToDelete
source: Long press to delete attendance
id: Tekan lama untuk menghapus absensi

source: All Dates
id: Semua Tanggal

source: Pick date range
id: Pilih rentang tanggal

# filterReset
source: Date filter reset
id: Filter tanggal direset

# noHistory
source: No attendance data
id: Belum ada data presensi

source: Delete Attendance
id: Hapus Presensi

# deleteAttendanceConfirm
source: Are you sure you want to delete this attendance?
id: Apakah Anda yakin ingin menghapus presensi ini?

# deleteSuccess
source: Attendance deleted successfully
id: Presensi berhasil dihapus

# deleteFailed
source: Failed to delete attendance
id: Gagal menghapus presensi

# entryTime
source: Check In:
id: Masuk:

# exitTime
source: Check Out:
id: Pulang:

# statisticTitle
source: Attendance Statistic
id: Statistik Presensi

source: Total Absent
id: Total Absen

source: Total Present
id: Total Masuk

source: Total Permission
id: Total Izin

source: Attendance Today
id: Absen Hari Ini

source: Yes
id: Ya

source: Not Yet
id: Belum

# permissionTitle
source: Leave Request
id: Izin Presensi

# permissionForm
source: Leave Form
id: Formulir Izin

source: Date
id: Tanggal

source: Pick Date
id: Pilih Tanggal

source: Reason
id: Alasan

# reasonHint
source: Enter leave reason
id: Tuliskan alasan izin

# reasonRequired
source: Reason is required
id: Alasan wajib diisi

# submitPermission
source: Submit Request
id: Ajukan Izin

source: Submitting...
id: Mengajukan...

# myPermissionList
source: My Requests
id: Daftar Izin Saya

# noPermissionData
source: No leave data
id: Belum ada data izin

# reasonLabel
source: Reason:
id: Alasan:

# fillDateReason
source: Complete date & reason
id: Lengkapi tanggal & alasan izin

# permissionSuccess
source: Leave request submitted successfully
id: Izin berhasil diajukan

# permissionFailed
source: Failed to submit request
id: Gagal mengajukan izin

# loadingMessage
source: Loading...
id: Sedang memuat

# appDescription
source: This application is made to facilitate the attendance process and recording presence with a modern Material You based interface.
id: Aplikasi Presensi ini dibuat untuk mempermudah proses absensi dan pencatatan kehadiran dengan tampilan modern berbasis Material You.

source: Developer Info
id: Informasi Pengembang

# appVersion
source: Version {version}
id: Versi {version}

# editProfileTitle
source: Edit Profile
id: Sunting Profil

source: Full Name
id: Nama Lengkap

# nameRequired
source: Name cannot be empty
id: Nama tidak boleh kosong

source: Save Name
id: Simpan Nama

# photoUpdated
source: Profile photo updated successfully
id: Foto profil berhasil diperbarui

# uploadFailed
source: Failed to upload photo: {error}
id: Gagal upload foto: {error}

# updateNameSuccess
source: Name updated successfully
id: Nama berhasil diperbarui

# updateNameFailed
source: Failed to update name: {error}
id: Gagal update nama: {error}

# registerTitle
source: Register Presensi Kita
id: Daftar Presensi Kita

# passwordMismatch
source: Password and confirmation do not match
id: Password dan konfirmasi tidak sama

# chooseTrainingBatch
source: Choose Training and Batch first
id: Pilih Training dan Batch terlebih dahulu

# chooseGender
source: Choose gender first
id: Pilih jenis kelamin terlebih dahulu

# registerSuccess
source: Registration successful!
id: Registrasi berhasil!

# registerFailed
source: Registration failed
id: Registrasi gagal

# emailRequired
source: E-mail is required
id: E-mail wajib diisi

# genderLabel
source: Gender
id: Jenis Kelamin

# genderMale
source: Male
id: Laki-laki

# genderFemale
source: Female
id: Perempuan

# genderRequired
source: Gender must be chosen
id: Jenis kelamin wajib dipilih

# trainingLabel
source: Choose Training
id: Pilih Training

# trainingRequired
source: Training must be chosen
id: Training wajib dipilih

# batchLabel
source: Choose Batch
id: Pilih Batch

# batchRequired
source: Batch must be chosen
id: Batch wajib dipilih

# passwordRequired
source: Password is required
id: Kata sandi wajib diisi

# confirmPasswordLabel
source: Confirm Password
id: Konfirmasi sandi

# confirmPasswordRequired
source: Confirmation is required
id: Konfirmasi wajib diisi

source: Back
id: Kembali

source: Register
id: Daftar

# haveAccount
source: Already have an account?
id: Sudah punya akun?

source: Login here
id: Login di sini

# statusNotYet
source: Not Present Yet
id: Belum Absen

# welcomeGreet
source: Welcome,
id: Selamat Datang,

source: Attendance Location
id: Lokasi Presensi

source: Fetching location...
id: Sedang mengambil lokasi...

# distanceTo
source: Your distance to PPKDJP: {distance}
id: Jarak anda ke PPKDJP: {distance}

source: Address not found
id: Alamat tidak ditemukan

source: Choose Date
id: Pilih Tanggal

# languageId
source: Indonesian
id: Bahasa Indonesia

# languageEn
source: English
id: Bahasa Inggris

# forgotPasswordTitle
source: Reset Password
id: Reset Kata Sandi

# otpLabel
source: OTP Code
id: Kode OTP

# otpEmpty
source: OTP cannot be empty
id: OTP tidak boleh kosong

# newPasswordLabel
source: New Password
id: Password Baru

# otpSuccess
source: OTP sent successfully
id: OTP berhasil dikirim

# otpFailed
source: Failed to send OTP: {error}
id: Gagal kirim OTP: {error}

# resetPasswordSuccess
source: Password updated successfully
id: Password berhasil diperbarui

# resetPasswordFailed
source: Failed to reset password: {error}
id: Gagal reset password: {error}

# sendOtpButton
source: Send OTP
id: Kirim OTP
